import React from "react";
import style from "./Faq.module.scss";
import SubTitle from "./../subTitle/subtitle";
import Faq from "react-faq-component";
export default function FaqQuestion() {
  const data = {
    rows: [
      {
        title: "के कोभिड - १९ लाई एन्टिबायोटिकको उपचार गर्न सकिन्छ?",
        content:
          "होईन। एन्टिबायोटिकले ब्याक्टेरियाहरूलाई मात्र काम गर्दछ, भाइरसको लागि होइन। यस कारणले एन्टिबायोटिकको साथ नयाँ कोरोना भाइरस रोगको उपचार गर्न सम्भव छैन।",
      },
      {
        title: "स्वास्थ्य मन्त्रालयले अस्पतालहरूलाई कसरी तयार गरिरहेको छ ?",
        content:
          "\nसरकारले अस्पतालहरूमा आइसोलेसनको व्यवस्था मिलाउने प्रक्रिया अघि बढाएको छ । अस्पतालहरूको तथ्यांकअनुसार प्रक्रिया अगाडि बढाइरहेका छौं । सम्भावित समस्याहरूलाई मध्यनजरमा राख्दै करिब १२०० वटा आइसोलेसनमार्फत सुविधा दिने व्यवस्था मिलाएका छौं । हामीलाई १७५ वटा आईसीयूको आवश्यकता देखिएको छ । जसमा चाहिँ अक्सिजनसहितको व्यवस्था गर्ने कुरा भइसकेको छ । जसमा १५० वटा आइसोलेसन वार्डहरू र १०० वटा आईसीयूहरू प्रदेश तहमा पनि निर्माणका लागि कुरा भइसकेको छ । यी कुराहरू हामीले नै गर्नुपर्ने हो जसमा हामी निरन्तर लागिरहेका छौं ।",
      },
      {
        title:
          "संक्रमण भए/नभएको थाहा पाउन जुन परीक्षण गरिन्छ, त्यसको रिपोर्ट प्राप्त हुन कति समय लाग्छ ?\n",
        content:
          "अहिले विश्व स्वास्थ्य संगठनले बनाएको प्रोटोकललाई आधार मानेर काम गर्दा ६ घण्टा लाग्छ । तर, बजारमा छिटो परीक्षण गर्ने किट्सहरू पनि आएको भन्ने सुनिन थालेको छ । नेपालमा पनि धेरै बिक्रीकर्ताहरूले हामी छिटो परीक्षण गर्ने किट्स ल्याइदिन्छौं भनेर भन्न आउनुहुन्छ । हामी त्यस्ता किटहरू परीक्षण गरेर हेर्छौं नि त दिनुस् न त भन्यो भनेचाहिँ उहाँहरूले उपलब्ध गराउन सक्नु हुन्न ।",
      },
      {
        title: "के यो आत्तिने समय हो?",
        content:
          "होईन। भाइरस चमत्कारी ढंगले नेपालमा प्रवेश गरिसकेको छैन, जनवरीमा एक केस बाहेक। अहिलेसम्म कसैले पनि कोविड- १९  का लागि सकारात्मक परीक्षण गरेका छैनन् र भाइरसको फैलावटलाई सीमित पार्न सरकारले यात्रा प्रतिबन्ध लगाएको छ। त्यहाँ भण्डारन गरिएको खाना, खाना पकाउने ग्यास वा हात सेनिटाइजरहरू सुरू गर्न आवश्यक छैन। यद्यपि यो माथिबाट पहिचान गरिएको जस्तो बुद्धिमानी सावधानी अपनाउन सधैं विवेकी हुन्छ।",
      },
      {
        title: "म कसरी आफूलाई सुरक्षित राख्न सक्छु?",
        content:
          "डब्ल्यूएचओ(WHO) काे सल्लाह अनुसार तपाईले साबुन पानीले हात कम्तिमा २० सेकेन्ड सम्म धुनुहोस् वा कम्तिमा ६०  प्रतिशत रक्सी सामग्रीको साथ ह्यान्ड सेनिटाइजर प्रयोग गर्नुहोस्  त्याे सबैभन्दा उपयोक्त हुन्छ । तपाईंको आँखा, नाक र मुखलाई अशुद्ध हातले छुनुहोस्। तपाईको कम्प्युटर र फोनहरू जस्तै प्राय: प्रयोग गरिएको सतहहरू सफा र कीटाणुरहित गर्नुहोस्। व्यक्तिहरूको ठूलो भीडमा सकेसम्म कम जानुहोस् । लक्षणहरू केहि दिन भन्दा लामो समय सम्म जारी रहन्छ भने चिकित्सलाई सम्पर्क गनुहोस् । \n",
      },
      {
        title: "यो रोग कत्तिको खतरनाक छ?",
        content:
          "कोविड १९  को मृत्युदर ३़़.६ प्रतिशत हुने अनुमान गरिएको छ, तर नयाँ अध्ययनले  ५.७प्रतिशतको दरलाई थोरै बढी राखेको छ। यद्यपि कोविड१९ युवा स्वस्थ व्यक्तिहरूको लागि ज्यादै खतरनाक छैन, बृद्ध व्यक्ति र प्रतिरक्षा-सम्झौता प्रणाली भएका व्यक्तिहरूको ज्यान जोखिममा पर्दछ। हृदय रोग, मधुमेह र फोक्सोको रोग जस्ता दीर्घकालीन चिकित्सा सर्तहरू भएका व्यक्तिहरू, वा जो हालसालै गम्भीर मेडिकल प्रक्रियाहरू भोगेका छन्, उनीहरू पनि जोखिममा छन्।",
      },
      {
        title: "Where did the virus come from?",
        content:
          "भाइरस पहिलो पटक डिसेम्बरको अन्तमा वुहान, चीनमा पहिचान भयो। कोरोनाभाइरस भाइरसहरूको एक ठूलो परिवार हो जुन सामान्य चिसो देखि मध्य पूर्व रेस्पीरेटरी सिन्ड्रोम (MERS) र गम्भिर तीव्र श्वसन सिन्ड्रोम (सार्स) को लागी सबैको लागि जिम्मेवार छ। हुबेई प्रान्तमा फैलिएको वुहानमा प्रारम्भिक प्रकोप पछि अन्तमा ८०,००००भन्दा बढीलाई संक्रमण गरी ३००० भन्दा बढी मारिए पछि मुख्य भूमि चीनमा नयाँ संक्रमण दर घटेको छ। यद्यपि यो रोग विश्वभर फैलिएको छ र यो एउटा डरलाग्दो दरमा छ।",
      },
      {
        title:
          "नोबेल कोरोना भाइरस परीक्षणको लागि कुन कुन नमुना संकलन गरिन्छ?\n",
        content:
          "यस परीक्षणको लागि Throat swab , Nasal swab आदि नमुना संकलन गरिन्छ ।",
      },
      {
        title: "Novel corona virus  test गर्नको लागि कति पैसा लाग्छ?\n",
        content: "हाललाई यो  test यस  प्रयोगशालामा निःशुल्क गरिन्छ।\n",
      },
      {
        title: "समुदाय फिंजिनुले के बुझिन्छ ?",
        content:
          "सामुदायिक फिंजिनु भन्नाले  त्यो क्षेत्रमा मानिसहरू भाइरसले संक्रमित भएका छन् तर   उनीहरू कसरी संक्रमित भएको निश्चित हुँदैन।\n",
      },
    ],
  };
  const styles = {
    rowTitleColor: "Black",
    rowContentColor: "#777e8b",
    arrowColor: "black",
  };
  return (
    <div className={`${style.faq}`}>
      <SubTitle Title='Frequently Asked Questions' line />
      <div className={style.FaqQuestion}>
        <Faq data={data} styles={styles} />
      </div>
    </div>
  );
}
